{
  "ifiveProject": [
    {
      "name": "window 호스팅 신청 자동화",
      "src": "mbti.jpeg",
      "duration": "2012.2 - 2012.5",
      "detail": "웹호스팅 신청 접수를 받아 IIS / MSSQL / FTP 세팅을 자동화 하는 시스템 ( powershell )\n\n[담당 업무]\n쉘스크립트 개발 \n\n[언어]\n파워쉘 ( powershell )\n\n[업무 내용]\n웹호스팅 신청 접수 시 IIS / MSSQL / FTP 계정 세팅을 자동화 처리 하기 위한 스크립트 개발\n\n[성과]\n기존 담당자들의 수동 세팅 대비 90% 이상 업무 효율 단축\n\n[상세]\n입사 당시 웹호스팅 서비스가 window / linux  두 종류를 제공하고 있었습니다.\n리눅스 호스팅은 bash shell script 를 통한 자동화가 되어 있었으나, 윈도우 호스팅은 cli 세팅 기능이 존재하지 않아\n약 30여장에 달하는 계정 세팅 문서를 토대로 사람이 직접 수동 세팅을 하고 있던 상황이었습니다.\n당시에 linux 는 자동화가 되어있는데, 윈도우시스템은 문서를 보고 GUI를 통해 수동으로 세팅을 하는 상황에 의문이 들었는데,\n저 뿐만이 아니라 함께 일하는 모두가 불편해 하는것을 보고 스크립트를 개발해 보기로 했습니다.\n당시에 지식과 노하우가 없어서 인터넷 레퍼런스 문서들과 윈도우 자체내에 구비된 도움말 항목들을 살펴보며 약 3개월에 걸쳐서 업무가 끝나고 퇴근후 남는 시간에 파워쉘과 iis / mssql 의 cli 명령어등을 학습하며 자동화 프로그램을 작성하였고 이를 공유 하여 세팅시간을 크게 단축하는 효과가 있었습니다.\n이때 일을 계기로 회사내에서 개발 업무 능력을 인정받아 개발자의 길로 들어서는 계기가 되었습니다.",
      "tag": ["powershell", "system", "window"]
    },
    {
      "name": "허브웹 관리자 페이지 리뉴얼",
      "src": "",
      "duration": "2013.2 - 2013.8",
      "detail": "허브웹 사이트 운영 관리자 페이지 리뉴얼 ( jQuery / php )\n\n[담당업무]\n웹페이지 리뉴얼\n\n[언어]\n백엔드 - php\n프론트엔드 - jquery / javascript\n\n[업무 내용]\n운영담당자의 관리자 페이지 리뉴얼\n\n[성과]\n웹호스팅 / 도메인 세팅 및 연장 누락 및 미답변 미처리 내역 누락 보완\n\n[상세]\n계정 세팅등 자동화 처리가 되고, 처리도중 문제 발생시 시스템 이메일로 메일 발송을 통하여 오류 내용을 공유하고 있었습니다.\n무통장입금의 경우 입금자의 입금 내역을 보고 해당 신청계정의 세팅 처리를 수동으로 진행하던 상황이었는데, 오류시 발송되는 메일 미확인 또는 입금내역 확인 누락등을 통해 세팅이 지연되는 상황이 종종 있었습니다.\n또한 1:1문의를 통한 문의 접수 시 확인후 재 안내 답변을 드리겠다는 안내 후 사후 조치가 제대로 이루어 지지 않는 현상이 발생되는 상황에서 웹사이트 내에 접속 상단에 관련된 미처리 사항들을 모두 카운팅 처리 하여 표기하며, javascript 타이머를 통해 2분마다 자동 갱신하여 미처리된 숫자를 바로 카운팅 가능하도록 대시보드를 구성하였고, 이를 통해 각종 세팅 누락 내역과 미처리 문의 내역들을 효율적으로 관리할 수 있도록 관리자 페이지 시스템을 개편하였습니다.",
      "tag": ["php", "codeigniter", "jquery", "html", "css"]
    },
    {
      "name": "모바일 빌더 프로그램 개발",
      "src": "",
      "duration": "2013.8 - 2014.8",
      "detail": "허브웹 모바일 웹빌더 프로그램 개발 ( web / jQuery Mobile)\n\n[담당업무]\n모바일 빌더툴 개발\n\n[언어]\njquery mobile\n\n[업무내용]\n빌더 모바일 게시판 개발\n\n[성과]\n자사 빌더 서비스의 모바일 전용 게시판 개발\n\n[상세]\n사내에서 자체개발한 웹빌더 프로그램이 있었습니다.\n당시에 모바일에서는 viewport 없이 pc 화면 그대로 작은 모습으로 축소하여 표시를 해서, 모바일 접근성이 낮은 수준이었습니다.\n이때 게시판 부분만 별도로 모바일에 최적화 되서 표시를 해주자는 의견이 있었고, 이에 따라 db 내의 게시물들을 조회해서 모바일 게시판을 제공하였습니다.\n덕분에 커뮤니티적인 측면에서 모바일 접근성이 크게 향상 되어 이용고객들의 만족감을 높여주었습니다.\n관리자 페이지 리뉴얼이 프론트엔드 측면의 기술 향상에 많은 도움이 되었다면, 이 개발업무를 통하여 백엔드 부분에 대한 측면에서 기술향상에 많은 도움이 되는 프로젝트 였습니다.",
      "tag": ["php", "jquery", "html", "css"]
    }
  ],

  "atyProject": [
    {
      "name": "아티 홈페이지 & 관리자 페이지 개발",
      "src": "",
      "duration": "2015.2 - 2021.12",
      "detail": "사이트 개발 ( web / php )\n신청 페이지 결제 프로세스 (pg) 및 관리자 페이지 연동\n\n[담당업무]\naty.kr 메인 사이트 개발 및 유지보수\n\n[언어]\nphp\n\n[성과]\n메인 서비스 사이트.\n신청 내역 pg 연동 및 고객문의, 에디터 프로그램 연동 및 도메인 세팅에 관련된 시스템 개발\n\n[상세]\n현 직장의 메인 서비스 사이트 입니다.\n신청 내역 확인 및 pg 연동을 통한 결제 프로세스, 유료 사용자의 에디터 기능 권한 제공 및 도메인 세팅과\n고객 문의 대응 등 서비스 사이트 개발건입니다.\n기본적인 기능은 서비스 초기부터 다른 개발자에 의해 구성이 되어 있는 상태였으며,\n사이트 리뉴얼을 통한 재 개편을 담당하여 진행 했습니다.",
      "tag": ["php", "codeigniter", "jquery", "html", "css"]
    },
    {
      "name": "아티 빌더 엔진 개발",
      "src": "",
      "duration": "2015.11 - 2021.12",
      "detail": "디자인 퍼블리싱 ( html / sass )\n신규 개체 기능 추가 ( react )\n버그 수정 및 유지보수\n\n[담당업무]\n퍼블리싱 - ( html / css )\n신규 개체 개발\nbugFix\n\n[언어]\nreact / scss / express / nodejs / apache / nginx / php / mysql / mongdb / docker\n\n[성과]\n메인 업무 프로젝트 유지보수.\n알려진 bugFix 및 신규 기능 개발.\n\n[상세]\n현재까지도 지속적으로 개발 및 유지보수를 진행하고 있는 웹사이트/쇼핑몰 빌더 프로젝트 입니다.\n초기 개발은 2015년부터 진행 되었으며, 이때에 퍼블리싱 포지션으로 함께 참여 했습니다.\n당시에 react 메인 환경 구성 및 세팅에는 참여하지 않고, 그누보드 기반의 php 개발 위주로 함께 참여했습니다.\n이후 유지보수 단계에서 메인 source 까지 개발에 참여하여 개발 환경을 파악하고, 알려진 bugFix 및 요구사항에 맞는 새로운 기능을 추가 개발하는 업무를 담당하고 있습니다.\n이 프로젝트로 인해 각종 통신과 api 연계, pg 연동 및 데이터 구성 방식 뿐만 아니라, 레거시 코드들로 인한 기술부채가 향후 얼마나 큰 문제가 되는지 직접 몸으로 체험하였으며, 재사용이 가능한 프로그래밍을 항상 염두에 두고 개발 하려는 자세를 배우게 되었습니다.\n개인적으로 가장 도움이 많이 되는 프로젝트 였습니다.",
      "tag": ["react", "express", "nginx", "docker", "php", "scss", "nodejs", "flux", "mysql", "mongodb", "apache"]
    }
  ]
}
